apache/nuttx/arch/arm/src/xmc4/xmc4_vadc.h
/********************************************************************************************************
 * arch/arm/src/xmc4/xmc4_vadc.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 * May include some logic from sample code provided by Infineon:
 *
 * Copyright (C) 2011-2015 Infineon Technologies AG. All rights reserved.
 *
 * Infineon Technologies AG (Infineon) is supplying this software for use
 * with Infineon's microcontrollers.  This file can be freely distributed
 * within development tools that are supporting such microcontrollers.
 *
 * THIS SOFTWARE IS PROVIDED AS IS. NO WARRANTIES, WHETHER EXPRESS,
 * IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS
 * SOFTWARE. INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR
 * SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ********************************************************************************************************/

#ifndef __ARCH_ARM_SRC_XMC4_XMC4_VADC_H
#define __ARCH_ARM_SRC_XMC4_XMC4_VADC_H

/********************************************************************************************************
 * Included Files
 ********************************************************************************************************/

#include <nuttx/config.h>
#include <stdint.h>
#include "xmc4_config.h"

#include "hardware/xmc4_vadc.h"

/********************************************************************************************************
 * Public Types
 ********************************************************************************************************/

/**
 *  Structure to handle the global and groups Input Class configurations.
 *  Configured parameters are sample time and conversion Mode.
 */

typedef struct
{
  /* GLOBICLASSx register config */

  union
  {
    struct
    {
      uint32_t sample_time_std_conv         : 5;  /* Sample time for channels.
                                                   * Range:[0x0 to 0x1F] */
      uint32_t                              : 3;
      uint32_t conversion_mode_standard     : 3;  /* Conversion mode for channels.
                                                   * Uses vadc_convmode_t */
      uint32_t                              : 5;
      uint32_t sampling_phase_emux_channel  : 5;  /* Sample time for EMUX channels.
                                                   * Range:[0x0 to 0x1F] */
      uint32_t                              : 3;
      uint32_t conversion_mode_emux         : 3;  /* Conversion mode for EMUX.
                                                   * Uses vadc_convmode_t */
      uint32_t                              : 5;
    };
    uint32_t iclass;
  };
} vadc_input_class_config_t;

/**
 *   Structure to handle the VADC Global registers configurations
 */

typedef struct
{
  /* GLOBBOUND register config */

  union
  {
    struct
    {
      uint32_t boundary0        : 12;  /* Boundary value for results comparison */
      uint32_t                  : 4;
      uint32_t boundary1        : 12;  /* Boundary value for results comparison */
      uint32_t                  : 4;
    };
    uint32_t globbound;
  };

  /* GLOBCFG register config */

  union
  {
    struct
    {
      uint32_t analog_clock_divider   : 5;   /* Clock for the converter. Range: [0x0 to 0x1F] */
      uint32_t                        : 2;
      uint32_t msb_conversion_clock   : 1;   /* Additional clock cycle for analog converter */
      uint32_t arbiter_clock_divider  : 2;   /* Request source arbiter clock divider.
                                              * Range: [0x0 to 0x3] */
      uint32_t                        : 5;
      uint32_t                        : 17;
    };
    uint32_t globcfg;
  };

  /* GLOBICLASS0 register config */

  vadc_input_class_config_t class0;

  /* GLOBICLASS1 register config */

  vadc_input_class_config_t class1;

  /* GLOBRCR register config */

  union
  {
    struct
    {
      uint32_t                        : 16;
      uint32_t data_reduction_control : 4;   /* Data reduction stages */
      uint32_t                        : 4;
      uint32_t wait_for_read_mode     : 1;   /* Results of the next conversion will not be overwritten. */
      uint32_t                        : 6;
      uint32_t event_gen_enable       : 1;   /* Generates an event on availability of new result. */
    };
    uint32_t globrcr;
  };

  /* CLC register config */

  union
  {
    struct
    {
      uint32_t module_disable             : 1;   /* Disables the module clock. */
      uint32_t                            : 2;
      uint32_t disable_sleep_mode_control : 1;   /* Set it to true in order to disable the Sleep mode */
      uint32_t                            : 28;
    };
    uint32_t clc;
  };
} vadc_global_config_t;

/**
 *   Structure to handle the VADC Groups registers configurations
 */

typedef struct
{
  /* GxICLASS0 register config */

  vadc_input_class_config_t   class0;

  /* GxICLASS1 register config */

  vadc_input_class_config_t   class1;

  /* GxBOUND register config */

  union
  {
    struct
    {
      uint32_t boundary0    : 12;  /* Boundary value for results comparison */
      uint32_t              : 4;
      uint32_t boundary1    : 12;  /* Boundary value for results comparison */
      uint32_t              : 4;
    };
    uint32_t g_bound;
  };

  /* GxARBCFG register config */

  union
  {
    struct
    {
      uint32_t                            : 4;
      uint32_t arbitration_round_length   : 2;  /* Number of arbiter slots to be considered */
      uint32_t                            : 1;
      uint32_t arbiter_mode               : 1;  /* Arbiter mode, either Continuous mode or Demand based. */
      uint32_t                            : 24;
    };
    uint32_t g_arbcfg;
  };
} vadc_group_config_t;

/**
 *   Structure to handle the VADC Groups Channel registers configurations
 */

typedef struct
{
  /* GxCHCTRy register config */

  union
  {
    struct
    {
      uint32_t input_class                : 2;  /* Input conversion class selection.
                                                 * Uses vadc_channel_conv_t */
      uint32_t                            : 2;
      uint32_t lower_boundary_select      : 2;  /* Which boundary register serves as lower bound? */
      uint32_t upper_boundary_select      : 2;  /* Which boundary register serves as upper bound? */
      uint32_t event_gen_criteria         : 2;  /* When should an event be generated? */
      uint32_t sync_conversion            : 1;  /* Enables synchronous conversion for the configured channel */
      uint32_t alternate_reference        : 1;  /* Input reference voltage selection either VARef or CH-0. */
      uint32_t                            : 4;
      uint32_t result_reg_number          : 4;  /* Group result register number */
      uint32_t use_global_result          : 1;  /* Use global result register for background request source channels */
      uint32_t result_alignment           : 1;  /* Alignment of the results read in the result register. */
      uint32_t                            : 6;
      uint32_t broken_wire_detect_channel : 2;  /* Source to be used to charge the capacitor for BWD feature. */
      uint32_t broken_wire_detect         : 1;  /* Configures extra phase before the capacitor is sampled. */
    };
    uint32_t chctr;
  };

  /* GxBFL register config */

  union
  {
    struct
    {
      uint32_t                           : 8;
#if (XMC_VADC_BOUNDARY_FLAG_SELECT == 1U)
      uint32_t flag_output_condition_ch0 : 1;    /* Condition for which the boundary flag should change. */
      uint32_t flag_output_condition_ch1 : 1;    /* Condition for which the boundary flag should change. */
      uint32_t flag_output_condition_ch2 : 1;    /* Condition for which the boundary flag should change. */
      uint32_t flag_output_condition_ch3 : 1;    /* Condition for which the boundary flag should change. */
#else
      uint32_t                           : 4;
#endif
      uint32_t                           : 4;
#if (XMC_VADC_BOUNDARY_FLAG_SELECT == 1U)
      uint32_t invert_boundary_flag_ch0  : 1;    /* Inverts boundary flag output. */
      uint32_t invert_boundary_flag_ch1  : 1;    /* Inverts boundary flag output. */
      uint32_t invert_boundary_flag_ch2  : 1;    /* Inverts boundary flag output. */
      uint32_t invert_boundary_flag_ch3  : 1;    /* Inverts boundary flag output. */
#else
      uint32_t boundary_flag_output_ch0  : 1;    /* Enable the boundary flag output on the specific channel. */
      uint32_t boundary_flag_output_ch1  : 1;    /* Enable the boundary flag output on the specific channel. */
      uint32_t boundary_flag_output_ch2  : 1;    /* Enable the boundary flag output on the specific channel. */
      uint32_t boundary_flag_output_ch3  : 1;    /* Enable the boundary flag output on the specific channel. */
#endif
      uint32_t                           : 12;
    };
    uint32_t bfl;
  };

#if (XMC_VADC_BOUNDARY_FLAG_SELECT == 1U)
  /* GxBFLC register config */

  union
  {
    struct
    {
      uint32_t boundary_flag_mode_ch0    : 4;     /* Specify the basic operation of boundary flag 0 */
      uint32_t boundary_flag_mode_ch1    : 4;     /* Specify the basic operation of boundary flag 1 */
      uint32_t boundary_flag_mode_ch2    : 4;     /* Specify the basic operation of boundary flag 2 */
      uint32_t boundary_flag_mode_ch3    : 4;     /* Specify the basic operation of boundary flag 3 */
      uint32_t                           : 16;
    };
    uint32_t bflc;
  };

#endif

