apache/nuttx/arch/arm/src/xmc4/xmc4_vadc.h
  bool    channel_priority;              /* Only non priority channels can be converted by Background Request Source */
  int8_t  alias_channel;                 /* Specifies the channel which has to be aliased with CH0/CH1.
                                          * Uses vadc_channel_alias_t */
} vadc_channel_config_t;

/**
 *  Structure handle the VADC scan request source.
 *  It can be either Channel Scan (0) or Background Scan (2).
 */

typedef struct
{
  uint32_t conv_start_mode        : 2;   /* This field determines how scan request source would request for
                                          * Uses vadc_startmode_t */
  uint32_t req_src_priority       : 2;   /* Request source priority for the arbiter. */

  /* BRSCTRL (Background Request) or GxASCTRL (Autoscan Source) register config */

  union
  {
    struct
    {
#if(XMC_VADC_GROUP_SRCREG_AVAILABLE == (1U))
      uint32_t src_specific_result_reg     : 4;     /* Use any one Group related result register as the destination
                                                     * for all conversions results. To use the  individual result register
                                                     * from each channel configuration, configure this field with 0x0 */
#else
      uint32_t                    : 4;
#endif
      uint32_t                    : 4;
      uint32_t trigger_signal     : 4;   /* Select one of the 16 possibilities for trigger. */
      uint32_t                    : 1;
      uint32_t trigger_edge       : 2;   /* Edge selection for trigger signal. */
      uint32_t                    : 1;
      uint32_t gate_signal        : 4;   /* Select one of the 16 possibilities for gating. */
      uint32_t                    : 8;
      uint32_t timer_mode         : 1;   /* Decides whether timer mode for equi-distant sampling shall be activated or not. */
      uint32_t                    : 3;
    };
    uint32_t asctrl;
  };

  /* BRSMR (Background Request) or GxASMR (Autoscan Source) register config */

  union
  {
    struct
    {
      uint32_t                    : 2;
      uint32_t external_trigger   : 1;   /* Conversions be initiated by external hardware trigger */
      uint32_t req_src_interrupt  : 1;   /* Request source event can be generated after a conversion sequence. */
      uint32_t enable_auto_scan   : 1;   /* Enables the continuous conversion mode. */
      uint32_t load_mode          : 1;   /* Selects load event mode. */
      uint32_t                    : 26;
    };
    uint32_t asmr;
  };
} vadc_scan_config_t;

typedef vadc_scan_config_t vadc_background_config_t;

/* Defines the power mode that can be selected for each group. */

typedef enum
{
  XMC_VADC_GROUP_POWERMODE_OFF       = 0,   /* Group is powered down */
  XMC_VADC_GROUP_POWERMODE_RESERVED1,       /* Reserved */
  XMC_VADC_GROUP_POWERMODE_RESERVED2,       /* Reserved */
  XMC_VADC_GROUP_POWERMODE_NORMAL    = 3    /* Group is powered up */
} vadc_group_powermode_t;

/* Defines the conversion input classes that can be selected for each channel. */

typedef enum
{
  XMC_VADC_CHANNEL_CONV_GROUP_CLASS0 = 0, /* Iclass0 specific to the group */
  XMC_VADC_CHANNEL_CONV_GROUP_CLASS1,     /* IClass1 specific to the group */
  XMC_VADC_CHANNEL_CONV_GLOBAL_CLASS0,    /* Iclass0 Module wide */
  XMC_VADC_CHANNEL_CONV_GLOBAL_CLASS1     /* IClass1 Module wide */
} vadc_channel_conv_t;

/* Defines channel alias for channels 0 and 1.
 * Other Channels can accept only XMC_VADC_CHANNEL_ALIAS_DISABLED.
 */

typedef enum
{
  XMC_VADC_CHANNEL_ALIAS_DISABLED = -1,
  XMC_VADC_CHANNEL_ALIAS_CH0 = 0,
  XMC_VADC_CHANNEL_ALIAS_CH1 = 1,
  XMC_VADC_CHANNEL_ALIAS_CH2 = 2,
  XMC_VADC_CHANNEL_ALIAS_CH3 = 3,
  XMC_VADC_CHANNEL_ALIAS_CH4 = 4,
  XMC_VADC_CHANNEL_ALIAS_CH5 = 5,
  XMC_VADC_CHANNEL_ALIAS_CH6 = 6,
  XMC_VADC_CHANNEL_ALIAS_CH7 = 7
} vadc_channel_alias_t;

/* Defines the conversion mode. It defines the resolution of conversion. */

typedef enum
{
  XMC_VADC_CONVMODE_12BIT       = 0,  /* Results of conversion are 12bits wide */
  XMC_VADC_CONVMODE_10BIT       = 1,  /* Results of conversion are 10bits wide */
  XMC_VADC_CONVMODE_8BIT        = 2,  /* Results of conversion are 8bits wide */
  XMC_VADC_CONVMODE_FASTCOMPARE = 5   /* Input signal compared with a preset range */
} vadc_convmode_t;

/* Defines the mode of operation of a channel, when an ongoing conversion gets interrupted in between. */

typedef enum
{
  XMC_VADC_STARTMODE_WFS = 0, /* An ongoing conversion completes without interruption */
  XMC_VADC_STARTMODE_CIR,     /* An ongoing conversion can be interrupted and resumed later */
  XMC_VADC_STARTMODE_CNR      /* An ongoing conversion can be interrupted and never resumed, check GxASMR.RPTDIS */
} vadc_startmode_t;

/* Defines the condition for gating the conversion requests. It can be used to set the ENGT field
 * of ASMR/BSMR/QMR register respectively for auto_scan/background_scan/queue request sources.
 */

typedef enum
{
  XMC_VADC_GATEMODE_BLOCK = 0,  /* External triggers are permanently blocked */
  XMC_VADC_GATEMODE_IGNORE,     /* External triggers are unconditionally passed */
  XMC_VADC_GATEMODE_ACTIVEHIGH, /* External trigger is passed only if the gate signal is high */
  XMC_VADC_GATEMODE_ACTIVELOW   /* External trigger is passed only if the gate signal is low */
} vadc_gatemode_t;

/********************************************************************************************************
 * Private Function
 ********************************************************************************************************/

static inline bool xmc_vadc_check_group_ptr(vadc_group_t *const group_ptr)
{
  return ((group_ptr == VADC_G0) || (group_ptr == VADC_G1)
            || (group_ptr == VADC_G2) || (group_ptr == VADC_G3));
}

/********************************************************************************************************
 * Public Function Prototypes
 ********************************************************************************************************/

/********************************************************************************************************
 * Name: xmc4_vadc_global_enable
 *
 * Description:
 *   Ungate the clock to the VADC module (if applicable) and bring the VADC
 *   module out of reset state.
 *   Called in xmc4_vadc_global_initialize.
 *
 ********************************************************************************************************/

void xmc4_vadc_global_enable(void);

/********************************************************************************************************
 * Name: xmc4_vadc_global_disable
 *
 * Description:
 *   Gate the clock to the VADC module (if applicable) and put the VADC
 *   module into the reset state
 *
 ********************************************************************************************************/

void xmc4_vadc_global_disable(void);

/********************************************************************************************************
 * Name: xmc4_vadc_global_initialize
 *
 * Description:
 *   Initializes the VADC global module with the associated
 *   configuration structure pointed by config. It initializes global input
 *   classes, boundaries , result resources by setting
 *   GLOBICLASS,GLOBBOUND,GLOBRCR registers. It also configures the global
 *   analog and digital clock dividers by setting GLOBCFG register.
 *
 ********************************************************************************************************/

